legacy/original-case/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.20 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0.20 0 0);
    }

    outlet
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
        inletValue      uniform (0.20 0 0);
    }

    pipeWall
    {
        type            noSlip;
    }
}

// ************************************************************************* //
